sparkfun/Pioneer_IoT_Kit_Shield/Firmware/XBee_WiFi/XBee_WiFi.cydsn/Generated_Source/PSoC6/UART.h
/***************************************************************************//**
* \file UART.h
* \version 1.0
*
*  This file provides constants and parameter values for the UART component.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(UART_CY_SCB_UART_PDL_H)
#define UART_CY_SCB_UART_PDL_H

#include "cyfitter.h"
#include "scb/cy_scb_uart.h"

#if defined(__cplusplus)
extern "C" {
#endif


/***************************************
*   Initial Parameter Constants
****************************************/

#define UART_DIRECTION  (3U)
#define UART_USE_IRQ    (1U != 0U)
#define UART_ENABLE_RTS (0U)
#define UART_ENABLE_CTS (0U)

/* UART direction enum */
#define UART_RX    (0x1U)
#define UART_TX    (0x2U)

#define UART_ENABLE_RX  (0UL != (UART_DIRECTION & UART_RX))
#define UART_ENABLE_TX  (0UL != (UART_DIRECTION & UART_TX))


/***************************************
*       Additional includes
***************************************/

#if (UART_USE_IRQ)
    #include "UART_SCB_IRQ.h"
    #include "cyapicallbacks.h"
#endif


/***************************************
*        Function Prototypes
***************************************/
/**
* \addtogroup group_general
* @{
*/
/* Component specific functions. */
void UART_Start(void);

/* Basic functions */
__STATIC_INLINE cy_en_scb_uart_status_t UART_Init(cy_stc_scb_uart_config_t const *config);
__STATIC_INLINE void     UART_DeInit(void);
__STATIC_INLINE void     UART_Enable(void);
__STATIC_INLINE void     UART_Disable(void);

/* Register callback. */
__STATIC_INLINE void     UART_RegisterCallback(scb_uart_handle_events_t callback);

/* Configuration change. */
#if (UART_ENABLE_CTS)
__STATIC_INLINE void UART_EnableCts(void);
__STATIC_INLINE void UART_DisableCts(void);
#endif /* (UART_ENABLE_CTS) */

#if (UART_ENABLE_RTS)
__STATIC_INLINE void     UART_SetRtsFifoLevel(uint32_t rxFifoLevel);
__STATIC_INLINE uint32_t UART_GetRtsFifoLevel(void);
#endif /* (UART_ENABLE_RTS) */

__STATIC_INLINE void     UART_EnableSkipStart(void);
__STATIC_INLINE void     UART_DisableSkipStart(void);

#if (UART_ENABLE_RX)
/* Low level: Receive direction. */
__STATIC_INLINE uint32_t UART_Get(void);
__STATIC_INLINE uint32_t UART_GetArray(void *rxBuf, uint32_t size);
__STATIC_INLINE void     UART_GetArrayBlocking(void *rxBuf, uint32_t size);
__STATIC_INLINE uint32_t UART_GetRxFifoStatus(void);
__STATIC_INLINE void     UART_ClearRxFifoStatus(uint32_t clearMask);
__STATIC_INLINE uint32_t UART_GetNumInRxFifo(void);
__STATIC_INLINE void     UART_ClearRxFifo(void);
#endif /* (UART_ENABLE_RX) */

#if (UART_ENABLE_TX)
/* Low level: Transmit direction. */
__STATIC_INLINE uint32_t UART_Put(uint32_t data);
__STATIC_INLINE uint32_t UART_PutArray(void *txBuf, uint32_t size);
__STATIC_INLINE void     UART_PutArrayBlocking(void *txBuf, uint32_t size);
__STATIC_INLINE void     UART_PutString(char string[]);
__STATIC_INLINE uint32_t UART_GetTxFifoStatus(void);
__STATIC_INLINE void     UART_ClearTxFifoStatus(uint32_t clearMask);
__STATIC_INLINE uint32_t UART_GetNumInTxFifo(void);
__STATIC_INLINE bool     UART_IsTxComplete(void);
__STATIC_INLINE void     UART_ClearTxFifo(void);
#endif /* (UART_ENABLE_TX) */
    
#if (UART_ENABLE_RX)
/* High level: Ring buffer functions. */
__STATIC_INLINE void     UART_StartRingBuffer(void *ringBuffer, uint32_t size);
__STATIC_INLINE void     UART_StopRingBuffer(void);
__STATIC_INLINE void     UART_ClearRingBuffer(void);
__STATIC_INLINE uint32_t UART_GetNumInRingBuffer(void);

/* High level: Receive direction functions. */
__STATIC_INLINE cy_en_scb_uart_status_t UART_Receive(void *rxBuf, uint32_t size);
__STATIC_INLINE void     UART_AbortReceive(void);
__STATIC_INLINE uint32_t UART_GetReceiveStatus(void);
__STATIC_INLINE uint32_t UART_GetNumReceived(void);
#endif /* (UART_ENABLE_RX) */

#if (UART_ENABLE_TX)
/* High level: Transmit direction functions. */
__STATIC_INLINE cy_en_scb_uart_status_t UART_Transmit(void *txBuf, uint32_t size);
__STATIC_INLINE void     UART_AbortTransmit(void);
__STATIC_INLINE uint32_t UART_GetTransmitStatus(void);
__STATIC_INLINE uint32_t UART_GetNumLeftToTransmit(void);
#endif /* (UART_ENABLE_TX) */

/* Interrupt handler */
__STATIC_INLINE void UART_Interrupt(void);
/** @} group_general */


/***************************************
*    Variables with External Linkage
***************************************/
/**
* \addtogroup group_globals
* @{
*/
extern uint8 UART_initVar;
extern cy_stc_scb_uart_config_t const UART_config;
extern cy_stc_scb_uart_context_t UART_context;
/** @} group_globals */


/***************************************
*         Preprocessor Macros
***************************************/
/**
* \addtogroup group_macros
* @{
*/
/** The pointer to the base address of the hardware */
#define UART_HW         ((CySCB_Type *) UART_SCB__HW)
/** @} group_macros */


/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: UART_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Init() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t UART_Init(cy_stc_scb_uart_config_t const *config)
{
   return Cy_SCB_UART_Init(UART_HW, config, &UART_context);
}


/*******************************************************************************
* Function Name: UART_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DeInit() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_DeInit(void)
{
    Cy_SCB_UART_DeInit(UART_HW);
}


