sparkfun/Pioneer_IoT_Kit_Shield/Firmware/XBee_WiFi/XBee_WiFi.cydsn/Generated_Source/PSoC6/UART.h
/*******************************************************************************
* Function Name: UART_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Enable() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_Enable(void)
{
    Cy_SCB_UART_Enable(UART_HW);
}


/*******************************************************************************
* Function Name: UART_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Disable() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_Disable(void)
{
    Cy_SCB_UART_Disable(UART_HW, &UART_context);
}


/*******************************************************************************
* Function Name: UART_RegisterCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_RegisterCallback() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_RegisterCallback(scb_uart_handle_events_t callback)
{
    Cy_SCB_UART_RegisterCallback(UART_HW, callback, &UART_context);
}


#if (UART_ENABLE_CTS)
/*******************************************************************************
* Function Name: UART_EnableCts
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_EnableCts() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_EnableCts(void)
{
    Cy_SCB_UART_EnableCts(UART_HW);
}


/*******************************************************************************
* Function Name: Cy_SCB_UART_DisableCts
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DisableCts() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_DisableCts(void)
{
    Cy_SCB_UART_DisableCts(UART_HW);
}
#endif /* (UART_ENABLE_CTS) */


#if (UART_ENABLE_RTS)
/*******************************************************************************
* Function Name: UART_SetRtsFifoLevel
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_SetRtsFifoLevel() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_SetRtsFifoLevel(uint32_t rxFifoLevel)
{
    Cy_SCB_UART_SetRtsFifoLevel(UART_HW, rxFifoLevel);
}


/*******************************************************************************
* Function Name: UART_GetRtsFifoLevel
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetRtsFifoLevel() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetRtsFifoLevel(void)
{
    return Cy_SCB_UART_GetRtsFifoLevel(UART_HW);
}
#endif /* (UART_ENABLE_RTS) */


/*******************************************************************************
* Function Name: UART_EnableSkipStart
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_EnableSkipStart() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_EnableSkipStart(void)
{
    Cy_SCB_UART_EnableSkipStart(UART_HW);
}


/*******************************************************************************
* Function Name: UART_DisableSkipStart
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_DisableSkipStart() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_DisableSkipStart(void)
{
    Cy_SCB_UART_DisableSkipStart(UART_HW);
}


#if (UART_ENABLE_RX)
/*******************************************************************************
* Function Name: UART_Get
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Get() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_Get(void)
{
    return Cy_SCB_UART_Get(UART_HW);
}


/*******************************************************************************
* Function Name: UART_GetArray
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetArray() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetArray(void *rxBuf, uint32_t size)
{
    return Cy_SCB_UART_GetArray(UART_HW, rxBuf, size);
}


/*******************************************************************************
* Function Name: UART_GetArrayBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetArrayBlocking() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_GetArrayBlocking(void *rxBuf, uint32_t size)
{
    Cy_SCB_UART_GetArrayBlocking(UART_HW, rxBuf, size);
}


/*******************************************************************************
* Function Name: UART_GetRxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetRxFifoStatus() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetRxFifoStatus(void)
{
    return Cy_SCB_UART_GetRxFifoStatus(UART_HW);
}


/*******************************************************************************
* Function Name: UART_ClearRxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRxFifoStatus() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_ClearRxFifoStatus(uint32_t clearMask)
{
    Cy_SCB_UART_ClearRxFifoStatus(UART_HW, clearMask);
}


