sparkfun/Pioneer_IoT_Kit_Shield/Firmware/XBee_WiFi/XBee_WiFi.cydsn/Generated_Source/PSoC6/UART.h
/*******************************************************************************
* Function Name: UART_GetNumInRxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInRxFifo() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetNumInRxFifo(void)
{
    return Cy_SCB_UART_GetNumInRxFifo(UART_HW);
}


/*******************************************************************************
* Function Name: UART_ClearRxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRxFifo() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_ClearRxFifo(void)
{
    Cy_SCB_UART_ClearRxFifo(UART_HW);
}
#endif /* (UART_ENABLE_RX) */


#if (UART_ENABLE_TX)
/*******************************************************************************
* Function Name: UART_Put
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Put() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_Put(uint32_t data)
{
    return Cy_SCB_UART_Put(UART_HW,data);
}


/*******************************************************************************
* Function Name: UART_PutArray
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutArray() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_PutArray(void *txBuf, uint32_t size)
{
    return Cy_SCB_UART_PutArray(UART_HW, txBuf, size);
}


/*******************************************************************************
* Function Name: UART_PutArrayBlocking
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutArrayBlocking() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_PutArrayBlocking(void *txBuf, uint32_t size)
{
    Cy_SCB_UART_PutArrayBlocking(UART_HW, txBuf, size);
}


/*******************************************************************************
* Function Name: UART_PutString
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_PutString() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_PutString(char string[])
{
    Cy_SCB_UART_PutString(UART_HW, string);
}


/*******************************************************************************
* Function Name: UART_GetTxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetTxFifoStatus() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetTxFifoStatus(void)
{
    return Cy_SCB_UART_GetTxFifoStatus(UART_HW);
}


/*******************************************************************************
* Function Name: UART_ClearTxFifoStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearTxFifoStatus() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_ClearTxFifoStatus(uint32_t clearMask)
{
    Cy_SCB_UART_ClearTxFifoStatus(UART_HW, clearMask);
}


/*******************************************************************************
* Function Name: UART_GetNumInTxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInTxFifo() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetNumInTxFifo(void)
{
    return Cy_SCB_UART_GetNumInTxFifo(UART_HW);
}


/*******************************************************************************
* Function Name: UART_IsTxComplete
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_IsTxComplete() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE bool UART_IsTxComplete(void)
{
    return Cy_SCB_UART_IsTxComplete(UART_HW);
}


/*******************************************************************************
* Function Name: UART_ClearTxFifo
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearTxFifo() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_ClearTxFifo(void)
{
    Cy_SCB_UART_ClearTxFifo(UART_HW);
}
#endif /* (UART_ENABLE_TX) */


#if (UART_ENABLE_RX)
/*******************************************************************************
* Function Name: UART_StartRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_StartRingBuffer() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_StartRingBuffer(void *ringBuffer, uint32_t size)
{
    Cy_SCB_UART_StartRingBuffer(UART_HW, ringBuffer, size, &UART_context);
}


/*******************************************************************************
* Function Name: UART_StopRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_StopRingBuffer() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_StopRingBuffer(void)
{
    Cy_SCB_UART_StopRingBuffer(UART_HW, &UART_context);
}


