sparkfun/Pioneer_IoT_Kit_Shield/Firmware/XBee_WiFi/XBee_WiFi.cydsn/Generated_Source/PSoC6/UART.h
/*******************************************************************************
* Function Name: UART_ClearRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_ClearRingBuffer() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_ClearRingBuffer(void)
{
    Cy_SCB_UART_ClearRingBuffer(UART_HW, &UART_context);
}


/*******************************************************************************
* Function Name: UART_GetNumInRingBuffer
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumInRingBuffer() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetNumInRingBuffer(void)
{
    return Cy_SCB_UART_GetNumInRingBuffer(UART_HW, &UART_context);
}


/*******************************************************************************
* Function Name: UART_Receive
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Receive() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t UART_Receive(void *rxBuf, uint32_t size)
{
    return Cy_SCB_UART_Receive(UART_HW, rxBuf, size, &UART_context);
}


/*******************************************************************************
* Function Name: UART_GetReceiveStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetReceiveStatus() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetReceiveStatus(void)
{
    return Cy_SCB_UART_GetReceiveStatus(UART_HW, &UART_context);
}


/*******************************************************************************
* Function Name: UART_AbortReceive
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_AbortReceive() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_AbortReceive(void)
{
    Cy_SCB_UART_AbortReceive(UART_HW, &UART_context);
}


/*******************************************************************************
* Function Name: UART_GetNumReceived
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumReceived() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetNumReceived(void)
{
    return Cy_SCB_UART_GetNumReceived(UART_HW, &UART_context);
}
#endif /* (UART_ENABLE_RX) */


#if (UART_ENABLE_TX)
/*******************************************************************************
* Function Name: UART_Transmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Transmit() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_uart_status_t UART_Transmit(void *txBuf, uint32_t size)
{
    return Cy_SCB_UART_Transmit(UART_HW, txBuf, size, &UART_context);
}


/*******************************************************************************
* Function Name: UART_GetTransmitStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetTransmitStatus() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetTransmitStatus(void)
{
    return Cy_SCB_UART_GetTransmitStatus(UART_HW, &UART_context);
}


/*******************************************************************************
* Function Name: UART_AbortTransmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_AbortTransmit() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_AbortTransmit(void)
{
    Cy_SCB_UART_AbortTransmit(UART_HW, &UART_context);
}


/*******************************************************************************
* Function Name: UART_GetNumLeftToTransmit
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_GetNumLeftToTransmit() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE uint32_t UART_GetNumLeftToTransmit(void)
{
    return Cy_SCB_UART_GetNumLeftToTransmit(UART_HW, &UART_context);
}
#endif /* (UART_ENABLE_TX) */


/*******************************************************************************
* Function Name: UART_Interrupt
****************************************************************************//**
*
* Invokes the Cy_SCB_UART_Interrupt() PDL driver function. 
*
*******************************************************************************/
__STATIC_INLINE void UART_Interrupt(void)
{
#if defined (UART_INTERRUPT_ENTRY_CALLBACK)
    UART_InterruptEntryCallback();
#endif /* UART_INTERRUPT_ENTRY_CALLBACK */

    Cy_SCB_UART_Interrupt(UART_HW, &UART_context);
    
#if defined (UART_INTERRUPT_EXIT_CALLBACK)
    UART_InterruptExitCallback();
#endif /* UART_INTERRUPT_EXIT_CALLBACK */    
}

#if defined(__cplusplus)
}
#endif

#endif /* UART_CY_SCB_UART_PDL_H */


/* [] END OF FILE */
